#include <iostream>
#include <conio.h>
using namespace std;
#define OFFSET "\t\t\t\t"
int main()
{
	setlocale(LC_ALL, "Russian");
	char key; // код клавиши
	int otvet; // пункт меню
	cout << OFFSET << "===============================================================\n\n";
	cout << OFFSET << "                  Домашнее задание Массивы\n\n";
	cout << OFFSET << "                Милькин Сергей, группа СБУ 223\n\n";
	cout << OFFSET << "===============================================================\n\n";
	cout << "\t\t\t\t\t" << " Выберите пункт меню и нажмите ENTER\n";
	cout << "\t\t\t\t\t" << " Для выхода из программы нажмите Esc\n\n";

	do
	{
		cout << OFFSET << "===============================================================\n\n";
		cout << OFFSET << "1.   Вывести введенный массив \n\n";
		cout << OFFSET << "2.   Вывести массив в обратном порядке\n\n";
		cout << OFFSET << "3.   Вычислить сумму элементов массива\n\n";
		cout << OFFSET << "4.   Вычислить среднее-арифметическое элементов массива\n\n";
		cout << OFFSET << "5.   Найти минимальное и максимальное значение в массиве\n\n";
		cout << OFFSET << "Esc. Выход\n\n";
		cout << OFFSET << "===============================================================\n\n";
		otvet = _getch() - 48;

		// Задача 1
		if (otvet == 1)
		{
			if (otvet == 27 - 48)
			{
				cout << "Выход" << endl;
				break;            
			}

		}
		key = _getch();
	} while (key != 27);

}